nyar99/SmartLights/lab11/esp8266V.c
// esp8266.c
// Brief desicription of program:
// - Initializes an ESP8266 module to act as a WiFi client
//   and fetch weather data from openweathermap.org
//
/* 
  Author: Steven Prickett (steven.prickett@gmail.com)
 
  THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
  OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
  VALVANO SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
  OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.

*/
// http://www.xess.com/blog/esp8266-reflash/

// NOTE: ESP8266 resources below:
// General info and AT commands: http://nurdspace.nl/ESP8266
// General info and AT commands: http://www.electrodragon.com/w/Wi07c
// Community forum: http://www.esp8266.com/
// Offical forum: http://bbs.espressif.com/
// example http://zeflo.com/2014/esp8266-weather-display/

/* Modified by Jonathan Valvano
 Feb 3, 2016
 Hardware connections
 Vcc is a separate regulated 3.3V supply with at least 215mA
 /------------------------------\
 |              chip      1   8 |
 | Ant                    2   7 |
 | enna       processor   3   6 |
 |                        4   5 |
 \------------------------------/ 
ESP8266    TM4C123 
  1 URxD    PB1   UART out of TM4C123, 115200 baud
  2 GPIO0         +3.3V for normal operation (ground to flash)
  3 GPIO2         +3.3V
  4 GND     Gnd   GND (70mA)
  5 UTxD    PB0   UART out of ESP8266, 115200 baud
  6 Ch_PD         chip select, 10k resistor to 3.3V
  7 Reset   PB5   TM4C123 can issue output low to cause hardware reset
  8 Vcc           regulated 3.3V supply with at least 70mA
 */

/*
===========================================================
==========          CONSTANTS                    ==========
===========================================================
*/
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include "../../inc/tm4c123gh6pm.h"
#include "esp8266V.h"
#include "UARTV.h"
// Access point parameters
#define SSID_NAME "ATTiwmRXCT"
#define SEC_TYPE ESP8266_ENCRYPT_MODE_WPA2_PSK
#define PASSKEY "u55ek8yiiyw="


#define BUFFER_SIZE 1024
#define MAXTRY 20
// prototypes for functions defined in startup.s
void DisableInterrupts(void); // Disable interrupts
void EnableInterrupts(void);  // Enable interrupts
long StartCritical (void);    // previous I bit, disable interrupts
void EndCritical(long sr);    // restore I bit to previous value
void WaitForInterrupt(void);  // low power mode
// prototypes for helper functions
void DelayMs(uint32_t delay);
void ESP8266ProcessInput(const char* buffer);
void ESP8266HandleInputCommands(const char* input);
void ESP8266ParseSettingPointers(char* timePtr, char* shotsPtr, char* distPtr);
void ESP8266InitUART(void);
void ESP8266_PrintChar(char iput);
void ESP8266EnableRXInterrupt(void);
void ESP8266DisableRXInterrupt(void);
void ESP8266SendCommand(const char* inputString);
void ESP8266FIFOtoBuffer(void);


/*
=============================================================
==========            GLOBAL VARIABLES             ==========
=============================================================
*/

uint32_t RXBufferIndex = 0;
uint32_t LastReturnIndex = 0;
uint32_t CurrentReturnIndex = 0;
char RXBuffer[BUFFER_SIZE];
char TXBuffer[BUFFER_SIZE];
#define SERVER_RESPONSE_SIZE 1024
char ServerResponseBuffer[SERVER_RESPONSE_SIZE]; // characters after +IPD,
uint32_t ServerResponseIndex = 0;

volatile bool ESP8266_ProcessBuffer = false;
volatile bool ESP8266_EchoResponse = false;
volatile bool ESP8266_ResponseComplete = false;    
volatile bool ESP8266_APEnabled = false;
volatile bool ESP8266_ClientEnabled = false;
volatile bool ESP8266_ServerEnabled = false;
volatile bool ESP8266_InputProcessingEnabled = false;
volatile bool ESP8266_PageRequested = false;

/*
=======================================================================
==========              search FUNCTIONS                     ==========
=======================================================================
*/
#define BUFFERSIZE 11
char SearchString[32];
char serial_buffer[BUFFERSIZE];
char lastTempo[BUFFERSIZE];
volatile bool tempoSet = true;
volatile bool SearchLooking = false;
volatile bool SearchFound = false;
volatile bool SearchTimeZone = false;
volatile uint8_t TimeZoneSearchIndex = 0;
volatile uint32_t SearchIndex = 0;
char lc(char letter){
  if((letter>='A')&&(letter<='Z')) letter |= 0x20;
  return letter;
}
//-------------------bufferRotate -------------------
// - right shifts a buffer of fixed size
// Inputs: none
// Outputs: none
void bufferRotate(char letter){
  for (int i = 0; i < BUFFERSIZE-1; i++) {
      serial_buffer[i] = serial_buffer[i+1];
  }
  serial_buffer[BUFFERSIZE-1] = letter;
}
//-------------------printTempo -------------------
// - prints string to uart1 if it passes tempo conditions
// Inputs: none
// Outputs: none
void printTempo(void) {
  if (serial_buffer[BUFFERSIZE-2] == 'O' && serial_buffer[BUFFERSIZE-1] == 'K'){
    if (serial_buffer[3] == '.' || serial_buffer[4] == '.'){
			if(tempoSet){
				//memcpy(lastTempo, serial_buffer, sizeof(serial_buffer));
				for (int i = 0; i < BUFFERSIZE-2; i++){
					UART1_OutChar(serial_buffer[i]);  
				} 
				UART1_OutChar('\n');
				UART1_OutChar('\r');
			} else {
				tempoSet = true;
				memcpy(lastTempo, serial_buffer, sizeof(serial_buffer));
				for (int i = 0; i < BUFFERSIZE-2; i++){
					UART1_OutChar(serial_buffer[i]);  
				} 
				UART1_OutChar('\n');
				UART1_OutChar('\r');
			}
      
    }
  }
}


//-------------------SearchStart -------------------
// - start looking for string in received data stream
// Inputs: none
// Outputs: none
void SearchStart(char *pt){
  strcpy(SearchString,pt);
  SearchIndex = 0;
  SearchFound = false;
  SearchLooking = true;
}
//-------------------SearchCheck -------------------
// - start looking for string in received data stream
// Inputs: none
// Outputs: none
void SearchCheck(char letter){
  if(SearchLooking){
    if(SearchString[SearchIndex] == lc(letter)){ // match letter?
      SearchIndex++;
      if(SearchString[SearchIndex] == 0){ // match string?
        SearchFound = true;
        SearchLooking = false;  
      }        
    }else{
      SearchIndex = 0; // start over
    }
  }
}

char ServerResponseSearchString[16]="+ipd,";
volatile uint32_t ServerResponseSearchFinished = false;
volatile uint32_t ServerResponseSearchIndex = 0;
volatile uint32_t ServerResponseSearchLooking = 0;

//-------------------ServerResponseSearchStart -------------------
// - start looking for server response string in received data stream
// Inputs: none
// Outputs: none
void ServerResponseSearchStart(void){
  strcpy(ServerResponseSearchString,"+ipd,");
  ServerResponseSearchIndex = 0;
  ServerResponseSearchLooking = 1; // means look for "+IPD"
  ServerResponseSearchFinished = 0;
  ServerResponseIndex = 0;
}

//-------------------ServerResponseSearchCheck -------------------
// - start looking for string in received data stream
// Inputs: none
// Outputs: none
void ServerResponseSearchCheck(char letter){
  if(ServerResponseSearchLooking==1){
    if(ServerResponseSearchString[ServerResponseSearchIndex] == lc(letter)){ // match letter?
      ServerResponseSearchIndex++;
      if(ServerResponseSearchString[ServerResponseSearchIndex] == 0){ // match string?
        ServerResponseSearchLooking = 2; 
        strcpy(ServerResponseSearchString,"\r\nok\r\n"); 
        ServerResponseSearchIndex = 0;        
      }        
    }else{
      ServerResponseSearchIndex = 0; // start over
    }
  }else if(ServerResponseSearchLooking==2){
    if(ServerResponseIndex < SERVER_RESPONSE_SIZE){
      ServerResponseBuffer[ServerResponseIndex] = lc(letter); // copy data from "+IPD," to "OK"
      ServerResponseIndex++;
    }
    if(ServerResponseSearchString[ServerResponseSearchIndex] == lc(letter)){ // match letter?
      ServerResponseSearchIndex++;
      if(ServerResponseSearchString[ServerResponseSearchIndex] == 0){   // match OK string?
        ServerResponseSearchFinished = 1;
        ServerResponseSearchLooking = 0;    
      }        
    }else{
      ServerResponseSearchIndex = 0; // start over
    }
  }
}
/*
=======================================================================
==========         UART1 and private FUNCTIONS               ==========
=======================================================================
*/
// Initialize UART5, interrupt driven
// Baud rate is 5,000,000/(ibrd+fbrd/64)
// ESP8266 needs 9600 bits/sec
// PE5=U5Tx,PE4=U5Rx UART5, bottom board
// inputs: ibrd,fbrd
//         priority 0 to 5 allowed
// outputs: none
void ESP8266_InitUART(uint32_t baud, int echo){
	//ESP8266_EchoResponse = echo;
	uint32_t priority = 2;
  SYSCTL_RCGCUART_R |= 0x20; // activate UART5
	while((SYSCTL_PRUART_R&0x20)==0){};

  SYSCTL_RCGCGPIO_R |= 0x10; // activate port E
	while((SYSCTL_PRGPIO_R&0x10)==0){}; 

  UART5_CTL_R &= ~UART_CTL_UARTEN;      // disable UART
         
  UART5_IBRD_R = 43;                   // IBRD = int(80,000,000 / (16 * 9600)) = int(520.833)
  UART5_FBRD_R = 26;                    // FBRD = round(0.833 * 64) = 53
  //UART5_IBRD_R = 520;                   // IBRD = int(80,000,000 / (16 * 9600)) = int(520.833)
  //UART5_FBRD_R = 53;                                      // 8 bit word length (no parity bits, one stop bit, FIFOs)
  UART5_LCRH_R = (UART_LCRH_WLEN_8|UART_LCRH_FEN);
  UART5_IFLS_R &= ~0x3F;                // clear TX and RX interrupt FIFO level fields
                                        // configure interrupt for TX FIFO <= 1/8 full
                                        // configure interrupt for RX FIFO >= 1/8 full
  UART5_IFLS_R += (UART_IFLS_TX1_8|UART_IFLS_RX1_8);
	//UART5_IFLS_R += UART_IFLS_RX1_8 ;                 // RX FIFO interrupt threshold >= 1/8th full

                                        // enable TX and RX FIFO interrupts and RX time-out interrupt
  UART5_IM_R |= (UART_IM_RXIM|UART_IM_TXIM|UART_IM_RTIM);
  UART5_CTL_R |= UART_CTL_UARTEN;       // enable UART
  GPIO_PORTE_AFSEL_R |= 0x30;           // enable alt funct on PE5-4
  GPIO_PORTE_DEN_R |= 0x30;             // enable digital I/O on PE5-4
                                        // configure PE5-4 as UART
  GPIO_PORTE_PCTL_R = (GPIO_PORTE_PCTL_R&0xFF00FFFF)+0x00110000;
  GPIO_PORTE_AMSEL_R &= ~0x30;          // disable analog functionality on PE
                                        // set priority
  NVIC_PRI15_R = (NVIC_PRI15_R&0xFFFF00FF)|(priority<<13); // bits 13-15
  //interrupt 61, n=15, Bits 15:13 Interrupt [4n+1]
  NVIC_EN1_R = 0x01<<(61-32);           // enable interrupt 61 in NVIC
}

