nyar99/SmartLights/lab11/esp8266V.c
//---------ESP8266_SetWifiMode----------
// configures the esp8266 to operate as a wifi client, access point, or both
// since it searches for "no change" it will execute twice when changing modes
// Input: mode accepts ESP8266_WIFI_MODE constants
// output: 1 if success, 0 if fail 
int ESP8266_SetWifiMode(uint8_t mode){
  int try=MAXTRY;
  if(mode > ESP8266_WIFI_MODE_AP_AND_CLIENT)return 0; // fail
  SearchStart("no change");
	//SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CWMODE=%d\r\n", mode);
    ESP8266SendCommand((const char*)TXBuffer);
    DelayMsSearching(5000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}
 
//---------ESP8266_SetConnectionMux----------
// enables the esp8266 connection mux, required for starting tcp server
// Input: 0 (single) or 1 (multiple)
// output: 1 if success, 0 if fail 
int ESP8266_SetConnectionMux(uint8_t enabled){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CIPMUX=%d\r\n", enabled);
    ESP8266SendCommand((const char*)TXBuffer);
    DelayMsSearching(5000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//----------ESP8266_JoinAccessPoint------------
// joins a wifi access point using specified ssid and password
// input:  SSID and PASSWORD
// output: 1 if success, 0 if fail
int ESP8266_JoinAccessPoint(const char* ssid, const char* password){
  int try=MAXTRY;
	UART_OutString("Joining Access Point...\r\n");
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password);
    ESP8266SendCommand((const char*)TXBuffer);
    DelayMsSearching(4000);
    if(SearchFound){ 
			//UART_OutString("OK Found");
			return 1;
		} // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_ListAccessPoints----------
// lists available wifi access points
// Input: none
// output: 1 if success, 0 if fail 
int ESP8266_ListAccessPoints(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+CWLAP\r\n");
    DelayMsSearching(8000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

// ----------ESP8266_QuitAccessPoint-------------
// - disconnects from currently connected wifi access point
// Inputs: none
// Outputs: 1 if success, 0 if fail 
int ESP8266_QuitAccessPoint(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+CWQAP\r\n");
    DelayMsSearching(8000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//----------ESP8266_ConfigureAccessPoint------------
// configures esp8266 wifi access point settings
// use this function only when in AP mode (and not in client mode)
// input:  SSID, Password, channel, security
// output: 1 if success, 0 if fail
int ESP8266_ConfigureAccessPoint(const char* ssid, const char* password, uint8_t channel, uint8_t encryptMode){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CWSAP=\"%s\",\"%s\",%d,%d\r\n", ssid, password, channel, encryptMode);
    ESP8266SendCommand((const char*)TXBuffer);
    DelayMsSearching(4000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_GetIPAddress----------
// Get local IP address
// Input: none
// output: 1 if success, 0 if fail 
int ESP8266_GetIPAddress(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+CIFSR\r\n");   
    DelayMsSearching(5000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_MakeTCPConnection----------
// Establish TCP connection 
// Input: IP address or web page as a string
// output: 1 if success, 0 if fail 
int ESP8266_MakeTCPConnection(char *IPaddress){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CIPSTART=\"TCP\",\"%s\",8080\r\n", IPaddress);
    ESP8266SendCommand(TXBuffer);   // open and connect to a socket
    DelayMsSearching(8000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_SendTCP----------
// Send a TCP packet to server 
// Input: TCP payload to send
// output: 1 if success, 0 if fail 
int ESP8266_SendTCP(char* fetch){
  volatile uint32_t time,n;
  sprintf((char*)TXBuffer, "AT+CIPSEND=%d\r\n", strlen(fetch)+2);
  ESP8266SendCommand(TXBuffer);  
  DelayMs(50);
  ESP8266SendCommand(fetch);
	//ESP8266SendCommand("\n\r ");
  ServerResponseSearchStart();
  n = 8000;
  while(n&&(ServerResponseSearchFinished==0)){
    time = (75825*8)/91;  // 1msec, tuned at 80 MHz
    while(time){
      time--;
    }
    n--;
  }
  if(ServerResponseSearchFinished==0) return 0; // no response
  return 1; // success
}

//---------ESP8266_CloseTCPConnection----------
// Close TCP connection 
// Input: none
// output: 1 if success, 0 if fail 
int ESP8266_CloseTCPConnection(void){
  int try=1;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+CIPCLOSE\r\n");   
    DelayMsSearching(4000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}
//---------ESP8266_SetDataTransmissionMode----------
// set data transmission mode
// Input: 0 not data mode, 1 data mode; return "Link is builded" 
// output: 1 if success, 0 if fail 
int ESP8266_SetDataTransmissionMode(uint8_t mode){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CIPMODE=%d\r\n", mode);
    ESP8266SendCommand((const char*)TXBuffer);
    DelayMsSearching(5000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_GetStatus----------
// get status
// Input: none
// output: 1 if success, 0 if fail 
int ESP8266_GetStatus(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+CIPSTATUS\r\n");
    DelayMsSearching(5000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//---------ESP8266_GetVersionNumber----------
// get status
// Input: none
// output: 1 if success, 0 if fail 
int ESP8266_GetVersionNumber(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    ESP8266SendCommand("AT+GMR\r\n");
    DelayMsSearching(500);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}
// Program written by:
// - Steven Prickett  steven.prickett@gmail.com
//
// Brief desicription of program:
// - Initializes an ESP8266 module to act as a WiFi access
//   point with a http server (IP = ...) serving a webpage
//   that allows the user to enter a message to send to the
//   microcontroller. The message will then be relayed back
//   over the USB UART.
//
//*********************************************************  
/* 
  This work is copyright Steven Prickett (steven.prickett@gmail.com) and 
  licensed under a Creative Commons Attribution 3.0 Unported License, 
  available at:
  
  https://creativecommons.org/licenses/by/3.0/
 
  THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
  OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
  VALVANO SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
  OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
*/
uint16_t ESP8266_ServerPort = 80;
uint16_t ESP8266_ServerTimeout = 28800; 
// defines the form served by the http server

// ----------ESP8266_SetServerTimeout--------------
// - sets connection timeout for tcp server, 0-28800 seconds
// ***Prickett code for server, not used or tested in this client project
// Inputs: timeout parameter
// Outputs: none
void ESP8266_SetServerTimeout(uint16_t timeout){
  ESP8266_ServerTimeout = timeout;
  sprintf((char*)TXBuffer, "AT+CIPSTO=%d\r\n", ESP8266_ServerTimeout);
  ESP8266SendCommand((const char*)TXBuffer);
}

// --------ESP8266_EnableServer------------------
//  - enables tcp server on specified port
// ***Prickett code for server, not used or tested in this client project
// Inputs: port number
// Outputs: none
void ESP8266_EnableServer(uint16_t port){
  ESP8266_ServerPort = port;
  sprintf((char*)TXBuffer, "AT+CIPSERVER=1,%d\r\n", ESP8266_ServerPort);
  ESP8266SendCommand((const char*)TXBuffer);
}


//---------ESP8266_DisableServer----------
// disables tcp server
// ***Prickett code for server, not used or tested in this client project
// Input: none 
// output: 1 if success, 0 if fail 
int ESP8266_DisableServer(void){
  int try=MAXTRY;
  SearchStart("ok");
  while(try){
    sprintf((char*)TXBuffer, "AT+CIPSERVER=0,%d\r\n", ESP8266_ServerPort);
    ESP8266SendCommand((const char*)TXBuffer); 
    DelayMsSearching(4000);
    if(SearchFound) return 1; // success
    try--;
  }
  return 0; // fail
}

//-------------ESP8266ProcessInput--------
// - parses whether we're interested in the data that just came in or not
// ***Prickett code for server, not used or tested in this client project
// Input: buffer to process
// output: none
void ESP8266ProcessInput(const char* buffer){
  char* ptr;
  // "+IPD" indicates data coming in from IP server
  if (buffer[0] == '+' && buffer[1] == 'I' && buffer[2] == 'P' && buffer[3] == 'D' && buffer[8] != '\n'){     
    ptr = (char *)buffer + 7;
    while (*ptr != ':'){
      ptr++;
    }
    ptr++;

    // check for HTTP GET
    if (*ptr == 'G' && *(ptr + 1) == 'E' && *(ptr + 2) == 'T') {
      if (*(ptr + 5) == '?'){ // means data to process
        char* messagePtr = strstr(ptr, "message=") + 8;
        printf("Message from ESP8266: %s\n", messagePtr);
      }
      ESP8266_PageRequested = true;
    } else {
      // handle data that may be sent via means other than HTTP GET
    }
  }
}

const char formBody[] = 
  "<!DOCTYPE html><html><body><center> \
  <h1>Enter a message to send to your microcontroller!</h1> \
  <form> \
  <input type=\"text\" name=\"message\" value=\"Hello ESP8266!\"> \
  <br><input type=\"submit\" value=\"Go!\"> \
  </form></center></body></html>";


/*
========================================================================================================================
==========                                           HTTP FUNCTIONS                                           ==========
========================================================================================================================
*/

/*
===================================================================================================
  HTTP :: HTTP_ServePage
  
   - constructs and sends a web page via the ESP8266 server

   - NOTE: this seems to work for sending pages to Firefox (and maybe other PC-based browsers),
           but does not seem to load properly on iPhone based Safari. May need to add some more
           data to the header.
===================================================================================================
*/
void HTTP_ServePage(const char* body){
  char header[] = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nConnection: close\r\nContent-Length: ";
    
  char contentLength[16];
  sprintf(contentLength, "%d\r\n\r\n", strlen(body));
    
  sprintf((char*)TXBuffer, "AT+CIPSEND=%d,%d\r\n", 0, strlen(body) + strlen(contentLength) + strlen(header));
  ESP8266SendCommand((const char*)TXBuffer);
    
  DelayMs(100);
    
  ESP8266SendCommand(header);
  ESP8266SendCommand(contentLength);
  ESP8266SendCommand(body);    
}